---
kind: other
id: Properties.T:Autodesk.Revit.DB.PointClouds.PointIterator
source: html/409451d0-ccf2-44b0-c1b2-49ceb3d95bdf.htm
---
# PointIterator Properties

Specifies whether the .NET object represents a valid Revit entity.